
{
"Toán học": [
    { "chapter": "Chương I: Ứng dụng đạo hàm để khảo sát và vẽ đồ thị của hàm số", "lesson": "Bài 1: Tính đơn điệu và cực trị của hàm số", "summary": "Xét chiều biến thiên và tìm các điểm cực đại, cực tiểu của hàm số dựa vào đạo hàm." },
    { "chapter": "Chương I: Ứng dụng đạo hàm để khảo sát và vẽ đồ thị của hàm số", "lesson": "Bài 2: Giá trị lớn nhất và giá trị nhỏ nhất của hàm số", "summary": "Phương pháp tìm GTLN, GTNN của hàm số trên một khoảng hoặc một đoạn." },
    { "chapter": "Chương I: Ứng dụng đạo hàm để khảo sát và vẽ đồ thị của hàm số", "lesson": "Bài 3: Đường tiệm cận của đồ thị hàm số", "summary": "Định nghĩa và cách tìm tiệm cận đứng, tiệm cận ngang của đồ thị hàm số." },
    { "chapter": "Chương I: Ứng dụng đạo hàm để khảo sát và vẽ đồ thị của hàm số", "lesson": "Bài 4: Khảo sát sự biến thiên và vẽ đồ thị của hàm số", "summary": "Các bước khảo sát và vẽ đồ thị hàm số bậc ba, hàm phân thức hữu tỉ đơn giản." },
    { "chapter": "Chương I: Ứng dụng đạo hàm để khảo sát và vẽ đồ thị của hàm số", "lesson": "Bài 5: Ứng dụng đạo hàm để giải quyết một số vấn đề thực tiễn", "summary": "Giải quyết các bài toán tối ưu hóa trong kinh tế, kỹ thuật và đời sống." },
    { "chapter": "Chương II: Vector và hệ tọa độ trong không gian", "lesson": "Bài 6: Vector trong không gian", "summary": "Khái niệm vector, các phép toán vector và sự đồng phẳng của các vector trong không gian." },
    { "chapter": "Chương II: Vector và hệ tọa độ trong không gian", "lesson": "Bài 7: Hệ tọa độ trong không gian", "summary": "Tọa độ của điểm, tọa độ của vector và biểu thức tọa độ của các phép toán." },
    { "chapter": "Chương II: Vector và hệ tọa độ trong không gian", "lesson": "Bài 8: Biểu thức tọa độ của các phép toán vector", "summary": "Tích vô hướng, tích có hướng của hai vector và ứng dụng tính diện tích, thể tích." },
    { "chapter": "Chương III: Các số đặc trưng đo mức độ phân tán cho mẫu số liệu ghép nhóm", "lesson": "Bài 9: Khoảng biến thiên và khoảng tứ phân vị của mẫu số liệu ghép nhóm", "summary": "Xác định các số đặc trưng đo độ trải rộng của mẫu số liệu đã ghép nhóm." },
    { "chapter": "Chương III: Các số đặc trưng đo mức độ phân tán cho mẫu số liệu ghép nhóm", "lesson": "Bài 10: Phương sai và độ lệch chuẩn của mẫu số liệu ghép nhóm", "summary": "Công thức tính phương sai và độ lệch chuẩn để đánh giá mức độ ổn định của dữ liệu." },
    { "chapter": "Chương IV: Nguyên hàm và tích phân", "lesson": "Bài 11: Nguyên hàm", "summary": "Định nghĩa nguyên hàm, các tính chất cơ bản và họ các nguyên hàm." },
    { "chapter": "Chương IV: Nguyên hàm và tích phân", "lesson": "Bài 12: Nguyên hàm của một số hàm số sơ cấp", "summary": "Bảng nguyên hàm của các hàm số thường gặp và phương pháp tính nguyên hàm." },
    { "chapter": "Chương IV: Nguyên hàm và tích phân", "lesson": "Bài 13: Định nghĩa tích phân và các tính chất cơ bản của tích phân", "summary": "Công thức Newton-Leibniz và các tính chất cộng tính, tuyến tính của tích phân." },
    { "chapter": "Chương IV: Nguyên hàm và tích phân", "lesson": "Bài 14: Ứng dụng hình học của tích phân", "summary": "Tính diện tích hình phẳng và thể tích khối tròn xoay bằng tích phân." },
    { "chapter": "Chương V: Phương pháp tọa độ trong không gian", "lesson": "Bài 15: Phương trình mặt phẳng", "summary": "Vectơ pháp tuyến và cách lập phương trình tổng quát của mặt phẳng." },
    { "chapter": "Chương V: Phương pháp tọa độ trong không gian", "lesson": "Bài 16: Phương trình đường thẳng trong không gian", "summary": "Vectơ chỉ phương, phương trình tham số và phương trình chính tắc của đường thẳng." },
    { "chapter": "Chương V: Phương pháp tọa độ trong không gian", "lesson": "Bài 17: Phương trình mặt cầu", "summary": "Xác định tâm, bán kính và lập phương trình chính tắc của mặt cầu." },
    { "chapter": "Chương VI: Xác suất có điều kiện", "lesson": "Bài 18: Xác suất có điều kiện", "summary": "Khái niệm xác suất của một biến cố khi biết một biến cố khác đã xảy ra." },
    { "chapter": "Chương VI: Xác suất có điều kiện", "lesson": "Bài 19: Công thức xác suất toàn phần và công thức Bayes", "summary": "Ứng dụng các công thức tính xác suất trong các bài toán thống kê phức tạp." }
],
"Ngữ văn": [
    { "chapter": "Tập 1", "lesson": "Bài 1: Khát vọng sống (Truyện truyền kì và truyện ngắn hiện đại)", "summary": "Khám phá vẻ đẹp tâm hồn và khát vọng của con người qua các tác phẩm truyền kì và hiện đại." },
    { "chapter": "Tập 1", "lesson": "Bài 2: Những thế giới khác nhau (Thơ hiện đại)", "summary": "Tìm hiểu tư duy nghệ thuật độc đáo và ngôn ngữ giàu sức gợi của các nhà thơ hiện đại." },
    { "chapter": "Tập 1", "lesson": "Bài 3: Khát vọng tự do (Văn bản kịch)", "summary": "Phân tích xung đột kịch và khát vọng tự do, công lí của nhân vật trong các vở kịch kinh điển." },
    { "chapter": "Tập 1", "lesson": "Bài 4: Sức mạnh của tiếng cười (Truyện cười và hài kịch)", "summary": "Nghiên cứu nghệ thuật trào phúng, các thủ pháp gây cười và ý nghĩa phê phán xã hội." },
    { "chapter": "Tập 1", "lesson": "Bài 5: Những góc nhìn đời sống (Văn bản nghị luận)", "summary": "Phân tích cách nhìn nhận, đánh giá các vấn đề xã hội và văn hóa qua lăng kính nghị luận sắc sảo." },
    { "chapter": "Tập 2", "lesson": "Bài 6: Ngọn nguồn của niềm tin (Truyện hiện đại)", "summary": "Tìm hiểu những giá trị nhân văn và điểm tựa tinh thần của con người trong hoàn cảnh khó khăn." },
    { "chapter": "Tập 2", "lesson": "Bài 7: Những âm vang của thời đại (Thơ và văn xuôi hậu hiện đại)", "summary": "Làm quen với các đặc điểm của chủ nghĩa hậu hiện đại trong văn học qua cấu trúc và ngôn ngữ." },
    { "chapter": "Tập 2", "lesson": "Bài 8: Tiếng nói của sự thật (Văn bản nhật dụng)", "summary": "Khai thác tính thời sự, tính xác thực và vai trò của văn bản nhật dụng đối với đời sống." },
    { "chapter": "Tập 2", "lesson": "Bài 9: Những hành trình văn hóa (Văn bản thông tin)", "summary": "Kết nối kiến thức văn hóa, lịch sử và địa lí qua cách tổ chức thông tin đa phương thức." }
],
"Tiếng Anh": [
    { "chapter": "Học kì I", "lesson": "Unit 1: Life stories we admire", "summary": "Học về tiểu sử các nhân vật truyền cảm hứng; ôn tập thì Quá khứ đơn vs. Quá khứ tiếp diễn." },
    { "chapter": "Học kì I", "lesson": "Unit 2: A sustainable planet", "summary": "Chủ đề bảo vệ hành tinh xanh và các cấu trúc câu phức (Complex sentences)." },
    { "chapter": "Học kì I", "lesson": "Unit 3: The green movement", "summary": "Tìm hiểu về phong trào sống xanh và cách sử dụng các cụm động từ (Phrasal verbs)." },
    { "chapter": "Học kì I", "lesson": "Unit 4: The mass media", "summary": "Tác động của truyền thông đại chúng; học về danh động từ và động từ nguyên mẫu." },
    { "chapter": "Học kì I", "lesson": "Unit 5: Cultural identity", "summary": "Bản sắc văn hóa dân tộc trong thời đại toàn cầu; học về các loại mệnh đề quan hệ." },
    { "chapter": "Học kì II", "lesson": "Unit 6: Artificial intelligence", "summary": "Sự phát triển của trí tuệ nhân tạo; học về câu điều kiện loại 2 và loại 3." },
    { "chapter": "Học kì II", "lesson": "Unit 7: The world of work", "summary": "Chuẩn bị cho thế giới nghề nghiệp; học về các cấu trúc so sánh kép." },
    { "chapter": "Học kì II", "lesson": "Unit 8: Academic pathways", "summary": "Các con đường học thuật sau THPT; học về các loại câu gián tiếp." },
    { "chapter": "Học kì II", "lesson": "Unit 9: Choosing a career", "summary": "Kỹ năng lựa chọn nghề nghiệp phù hợp; học về cách sử dụng các liên từ nối." },
    { "chapter": "Học kì II", "lesson": "Unit 10: Lifelong learning", "summary": "Tầm quan trọng của việc học tập suốt đời và ôn tập tổng hợp các cấu trúc ngữ pháp." }
],
"Vật lí": [
    { "chapter": "Chương 1: Vật lí nhiệt", "lesson": "Bài 1: Nội năng. Định luật I của nhiệt động lực học", "summary": "Khái niệm nội năng, cách làm biến đổi nội năng và ứng dụng định luật I nhiệt động lực học." },
    { "chapter": "Chương 1: Vật lí nhiệt", "lesson": "Bài 2: Thang nhiệt độ. Nhiệt kế", "summary": "Các loại thang nhiệt độ (Celsius, Kelvin) và nguyên lí hoạt động của các loại nhiệt kế." },
    { "chapter": "Chương 1: Vật lí nhiệt", "lesson": "Bài 3: Nhiệt dung riêng, nhiệt nóng chảy riêng, nhiệt hóa hơi riêng", "summary": "Định nghĩa và công thức tính nhiệt lượng trong các quá trình biến đổi trạng thái của chất." },
    { "chapter": "Chương 1: Vật lí nhiệt", "lesson": "Bài 4: Thực hành: Xác định nhiệt dung riêng, nhiệt nóng chảy riêng, nhiệt hóa hơi riêng", "summary": "Sử dụng các thiết bị thí nghiệm để đo đạc và tính toán các đại lượng nhiệt đặc trưng." },
    { "chapter": "Chương 2: Khí lí tưởng", "lesson": "Bài 5: Định luật Boyle. Định luật Charles", "summary": "Nghiên cứu các đẳng quá trình của khí lí tưởng: đẳng nhiệt và đẳng áp." },
    { "chapter": "Chương 2: Khí lí tưởng", "lesson": "Bài 6: Phương trình trạng thái của khí lí tưởng", "summary": "Xây dựng mối liên hệ giữa P, V, T và ứng dụng phương trình Clapeyron - Mendeleev." },
    { "chapter": "Chương 2: Khí lí tưởng", "lesson": "Bài 7: Á suất, động năng phân tử khí", "summary": "Giải thích áp suất khí dưới góc độ động học phân tử và mối liên hệ với nhiệt độ." },
    { "chapter": "Chương 3: Từ trường", "lesson": "Bài 8: Khái niệm từ trường. Lực từ", "summary": "Đặc điểm của từ trường, đường sức từ và lực từ tác dụng lên dây dẫn mang dòng điện." },
    { "chapter": "Chương 3: Từ trường", "lesson": "Bài 9: Hiện tượng cảm ứng điện từ. Tự cảm", "summary": "Điều kiện xuất hiện dòng điện cảm ứng, định luật Faraday và hiện tượng tự cảm trong mạch." },
    { "chapter": "Chương 3: Từ trường", "lesson": "Bài 10: Thực hành: Xác định cảm ứng từ của Trái Đất", "summary": "Phương pháp sử dụng các thiết bị đo để xác định thành phần nằm ngang của từ trường Trái Đất." },
    { "chapter": "Chương 4: Vật lí hạt nhân", "lesson": "Bài 11: Cấu tạo hạt nhân. Năng lượng liên kết hạt nhân", "summary": "Thành phần hạt nhân (proton, neutron), lực hạt nhân và độ hụt khối." },
    { "chapter": "Chương 4: Vật lí hạt nhân", "lesson": "Bài 12: Phóng xạ. Phản ứng hạt nhân", "summary": "Các loại tia phóng xạ, định luật phóng xạ và ứng dụng của phản ứng phân hạch, nhiệt hạch." }
],
"Hóa học": [
    { "chapter": "Chương 1: Ester – Lipid", "lesson": "Bài 1: Ester – Lipid", "summary": "Khái niệm, danh pháp, tính chất hóa học và ứng dụng của ester và chất béo." },
    { "chapter": "Chương 1: Ester – Lipid", "lesson": "Bài 2: Xà phòng và chất giặt rửa", "summary": "Cơ chế tẩy rửa của xà phòng và các loại chất giặt rửa tổng hợp." },
    { "chapter": "Chương 2: Carbohydrate", "lesson": "Bài 3: Glucose và fructose", "summary": "Cấu tạo dạng mạch hở, mạch vòng và các phản ứng đặc trưng của đường đơn." },
    { "chapter": "Chương 2: Carbohydrate", "lesson": "Bài 4: Saccharose, tinh bột và cellulose", "summary": "Cấu trúc polymer sinh học và vai trò của đường đa trong đời sống." },
    { "chapter": "Chương 3: Hợp chất chứa nitrogen", "lesson": "Bài 5: Amine", "summary": "Phân loại, bậc amine và tính chất hóa học đặc trưng của nhóm chức amine." },
    { "chapter": "Chương 3: Hợp chất chứa nitrogen", "lesson": "Bài 6: Amino acid và peptide", "summary": "Cấu tạo lưỡng tính của amino acid và sự hình thành liên kết peptide." },
    { "chapter": "Chương 3: Hợp chất chứa nitrogen", "lesson": "Bài 7: Protein và enzyme", "summary": "Cấu trúc các bậc của protein và vai trò xúc tác sinh học của enzyme." },
    { "chapter": "Chương 4: Polymer", "lesson": "Bài 8: Đại cương về polymer", "summary": "Đặc điểm cấu trúc, tính chất vật lí và phương pháp tổng hợp polymer." },
    { "chapter": "Chương 4: Polymer", "lesson": "Bài 9: Vật liệu polymer", "summary": "Tìm hiểu về chất dẻo, tơ, cao su và vật liệu composite." },
    { "chapter": "Chương 5: Pin điện và điện phân", "lesson": "Bài 10: Thế điện cực chuẩn của kim loại", "summary": "Ý nghĩa của dãy thế điện cực và cách xác định thế điện cực chuẩn." },
    { "chapter": "Chương 5: Pin điện và điện phân", "lesson": "Bài 11: Pin điện hóa", "summary": "Cấu tạo, nguyên tắc hoạt động của pin Galvani và các loại nguồn điện hóa học." },
    { "chapter": "Chương 5: Pin điện và điện phân", "lesson": "Bài 12: Điện phân", "summary": "Cơ chế điện phân nóng chảy và điện phân dung dịch; ứng dụng trong luyện kim." },
    { "chapter": "Chương 6: Đại cương về kim loại", "lesson": "Bài 13: Đại cương về kim loại", "summary": "Tính chất vật lí chung và tính chất hóa học đặc trưng (tính khử) của kim loại." },
    { "chapter": "Chương 6: Đại cương về kim loại", "lesson": "Bài 14: Tách kim loại và hợp kim", "summary": "Các phương pháp nhiệt luyện, thủy luyện và điện luyện để điều chế kim loại." },
    { "chapter": "Chương 6: Đại cương về kim loại", "lesson": "Bài 15: Sự ăn mòn và chống ăn mòn kim loại", "summary": "Phân biệt ăn mòn hóa học và ăn mòn điện hóa; các biện pháp bảo vệ kim loại." },
    { "chapter": "Chương 7: Sơ lược về kim loại chuyển tiếp và hợp chất phối trí", "lesson": "Bài 16: Kim loại chuyển tiếp dãy thứ nhất", "summary": "Đặc điểm cấu hình electron và tính chất của các kim loại như Fe, Cr, Cu." },
    { "chapter": "Chương 7: Sơ lược về kim loại chuyển tiếp và hợp chất phối trí", "lesson": "Bài 17: Phức chất", "summary": "Khái niệm về nguyên tử trung tâm, phối tử và cấu tạo của các hợp chất phức." }
],
"Sinh học": [
    { "chapter": "Chương 1: Di truyền học phân tử và di truyền học tế bào", "lesson": "Bài 1: Gene và cơ chế tái bản DNA", "summary": "Cấu trúc của gene và quá trình nhân đôi DNA đảm bảo truyền đạt thông tin di truyền." },
    { "chapter": "Chương 1: Di truyền học phân tử và di truyền học tế bào", "lesson": "Bài 2: Phiên mã và dịch mã", "summary": "Quá trình tổng hợp RNA từ mạch khuôn DNA và quá trình tổng hợp protein tại ribosome." },
    { "chapter": "Chương 1: Di truyền học phân tử và di truyền học tế bào", "lesson": "Bài 3: Điều hòa biểu hiện gene", "summary": "Cơ chế kiểm soát hoạt động của gene, tiêu biểu là mô hình Operon Lac ở vi khuẩn." },
    { "chapter": "Chương 1: Di truyền học phân tử và di truyền học tế bào", "lesson": "Bài 4: Đột biến gene", "summary": "Các dạng đột biến điểm (thay thế, mất, thêm cặp nucleotide) và hậu quả của chúng." },
    { "chapter": "Chương 1: Di truyền học phân tử và di truyền học tế bào", "lesson": "Bài 5: Nhiễm sắc thể và đột biến nhiễm sắc thể", "summary": "Cấu trúc NST và các dạng đột biến cấu trúc, đột biến số lượng (lệch bội, đa bội)." },
    { "chapter": "Chương 2: Quy luật di truyền", "lesson": "Bài 6: Di truyền học Mendel", "summary": "Quy luật phân li và phân li độc lập dựa trên thí nghiệm lai đậu Hà Lan." },
    { "chapter": "Chương 2: Quy luật di truyền", "lesson": "Bài 7: Hiện tượng di truyền liên kết và hoán vị gene", "summary": "Thí nghiệm của Morgan trên ruồi giấm về sự di truyền cùng nhau của các gene." },
    { "chapter": "Chương 2: Quy luật di truyền", "lesson": "Bài 8: Di truyền liên kết với giới tính và di truyền ngoài nhân", "summary": "Cách thức truyền tính trạng nằm trên NST giới tính và di truyền qua tế bào chất." },
    { "chapter": "Chương 2: Quy luật di truyền", "lesson": "Bài 9: Ảnh hưởng của môi trường đến sự biểu hiện của gene", "summary": "Mối quan hệ giữa kiểu gene, môi trường và kiểu hình; khái niệm mức phản ứng." },
    { "chapter": "Chương 2: Quy luật di truyền", "lesson": "Bài 10: Di truyền quần thể", "summary": "Cấu trúc di truyền của quần thể tự phối và quần thể ngẫu phối (Định luật Hardy-Weinberg)." },
    { "chapter": "Chương 3: Ứng dụng di truyền học", "lesson": "Bài 11: Chọn giống vật nuôi và cây trồng", "summary": "Các phương pháp chọn lọc, tạo giống ưu thế lai và giống gây đột biến." },
    { "chapter": "Chương 3: Ứng dụng di truyền học", "lesson": "Bài 12: Công nghệ tế bào và công nghệ gene", "summary": "Kỹ thuật nuôi cấy mô, nhân bản vô tính và tạo sinh vật biến đổi gene (GMO)." },
    { "chapter": "Chương 4: Tiến hóa", "lesson": "Bài 13: Bằng chứng và các học thuyết tiến hóa", "summary": "Bằng chứng giải phẫu, phôi sinh, sinh học phân tử và học thuyết Darwin, Lamark." },
    { "chapter": "Chương 4: Tiến hóa", "lesson": "Bài 14: Các nhân tố tiến hóa và quá trình hình thành loài", "summary": "Tác động của chọn lọc tự nhiên, đột biến, di nhập gene đến vốn gene quần thể." },
    { "chapter": "Chương 4: Tiến hóa", "lesson": "Bài 15: Sự phát sinh và phát triển sự sống trên Trái Đất", "summary": "Các giai đoạn tiến hóa hóa học, tiền sinh học và lịch sử phát triển qua các đại địa chất." },
    { "chapter": "Chương 5: Sinh thái học và môi trường", "lesson": "Bài 16: Môi trường và các nhân tố sinh thái", "summary": "Tác động của các nhân tố hữu sinh, vô sinh và giới hạn sinh thái của sinh vật." },
    { "chapter": "Chương 5: Sinh thái học và môi trường", "lesson": "Bài 17: Sinh thái học quần thể", "summary": "Đặc trưng cơ bản của quần thể: mật độ, tỉ lệ giới tính, kiểu phân bố, tăng trưởng." },
    { "chapter": "Chương 5: Sinh thái học và môi trường", "lesson": "Bài 18: Sinh thái học quần xã", "summary": "Cấu trúc quần xã, các mối quan hệ hỗ trợ/đối kháng và hiện tượng diễn thế sinh thái." },
    { "chapter": "Chương 5: Sinh thái học và môi trường", "lesson": "Bài 19: Hệ sinh thái và chu trình sinh địa hóa", "summary": "Dòng năng lượng trong hệ sinh thái và chu trình các chất (Carbon, Nitơ, Nước)." },
    { "chapter": "Chương 5: Sinh thái học và môi trường", "lesson": "Bài 20: Sinh quyển và bảo tồn tài nguyên thiên nhiên", "summary": "Các khu sinh học trên Trái Đất và chiến lược phát triển bền vững, bảo vệ đa dạng sinh học." }
],
"Lịch sử": [
    { "chapter": "Chương I: Thế giới sau Chiến tranh thế giới thứ hai đến nay", "lesson": "Bài 1: Liên hợp quốc", "summary": "Sự thành lập, vai trò và các nguyên tắc hoạt động của tổ chức đa phương lớn nhất hành tinh." },
    { "chapter": "Chương I: Thế giới sau Chiến tranh thế giới thứ hai đến nay", "lesson": "Bài 2: Trật tự thế giới trong Chiến tranh lạnh", "summary": "Sự hình thành trật tự hai cực Ianta và những diễn biến chính của cuộc đối đầu Đông - Tây." },
    { "chapter": "Chương I: Thế giới sau Chiến tranh thế giới thứ hai đến nay", "lesson": "Bài 3: Trật tự thế giới sau Chiến tranh lạnh", "summary": "Sự sụp đổ của trật tự hai cực và xu thế đa cực, hội nhập toàn cầu hiện nay." },
    { "chapter": "Chương II: ASEAN: Những chặng đường lịch sử", "lesson": "Bài 4: Sự ra đời và phát triển của ASEAN", "summary": "Quá trình hình thành và mở rộng từ ASEAN 5 đến ASEAN 10; vai trò của Hiệp ước Bali." },
    { "chapter": "Chương II: ASEAN: Những chặng đường lịch sử", "lesson": "Bài 5: Cộng đồng ASEAN: Từ ý tưởng đến hiện thực", "summary": "Ba trụ cột của Cộng đồng ASEAN và những triển vọng phát triển bền vững trong khu vực." },
    { "chapter": "Chương III: Cách mạng tháng Tám năm 1945, chiến tranh giải phóng dân tộc và chiến tranh bảo vệ Tổ quốc trong lịch sử Việt Nam", "lesson": "Bài 6: Cách mạng tháng Tám năm 1945", "summary": "Bối cảnh, diễn biến và ý nghĩa lịch sử của việc khai sinh nước Việt Nam Dân chủ Cộng hòa." },
    { "chapter": "Chương III: Cách mạng tháng Tám năm 1945, chiến tranh giải phóng dân tộc và chiến tranh bảo vệ Tổ quốc trong lịch sử Việt Nam", "lesson": "Bài 7: Cuộc kháng chiến chống thực dân Pháp (1945 - 1954)", "summary": "Các chiến dịch lớn và đỉnh cao là thắng lợi Điện Biên Phủ chấn động địa cầu." },
    { "chapter": "Chương III: Cách mạng tháng Tám năm 1945, chiến tranh giải phóng dân tộc và chiến tranh bảo vệ Tổ quốc trong lịch sử Việt Nam", "lesson": "Bài 8: Cuộc kháng chiến chống Mỹ, cứu nước (1954 - 1975)", "summary": "Hành trình chiến đấu kiên cường và thắng lợi vang dội của Chiến dịch Hồ Chí Minh lịch sử." },
    { "chapter": "Chương III: Cách mạng tháng Tám năm 1945, chiến tranh giải phóng dân tộc và chiến tranh bảo vệ Tổ quốc trong lịch sử Việt Nam", "lesson": "Bài 9: Chiến tranh bảo vệ Tổ quốc và lao động sáng tạo sau năm 1975", "summary": "Các cuộc chiến đấu bảo vệ biên giới và công cuộc Đổi mới, kiến thiết đất nước." },
    { "chapter": "Chương IV: Đối ngoại của Việt Nam thời hiện đại", "lesson": "Bài 10: Khối đại đoàn kết dân tộc trong lịch sử Việt Nam", "summary": "Vai trò của tinh thần đoàn kết trong sự nghiệp xây dựng và bảo vệ đất nước." },
    { "chapter": "Chương IV: Đối ngoại của Việt Nam thời hiện đại", "lesson": "Bài 11: Công tác đối ngoại của Việt Nam", "summary": "Đường lối đối ngoại độc lập, tự chủ, đa phương hóa, đa dạng hóa của Đảng và Nhà nước." }
],
"Địa lí": [
    { "chapter": "Chương 1: Địa lí dân cư", "lesson": "Bài 1: Đặc điểm dân số và sự phân bố dân cư", "summary": "Phân tích quy mô dân số, cơ cấu tuổi, giới tính và sự thay đổi mật độ dân cư tại các vùng miền Việt Nam." },
    { "chapter": "Chương 1: Địa lí dân cư", "lesson": "Bài 2: Lao động và việc làm", "summary": "Thực trạng nguồn lao động, vấn đề chuyển dịch cơ cấu lao động và giải quyết việc làm hiện nay." },
    { "chapter": "Chương 1: Địa lí dân cư", "lesson": "Bài 3: Đô thị hóa", "summary": "Đặc điểm quá trình đô thị hóa ở nước ta và tác động của nó đến phát triển kinh tế - xã hội." },
    { "chapter": "Chương 2: Chuyển dịch cơ cấu kinh tế", "lesson": "Bài 4: Chuyển dịch cơ cấu kinh tế", "summary": "Phân tích xu hướng chuyển dịch cơ cấu ngành, cơ cấu thành phần kinh tế và cơ cấu lãnh thổ." },
    { "chapter": "Chương 3: Địa lí các ngành kinh tế", "lesson": "Bài 5: Vấn đề phát triển nông nghiệp, lâm nghiệp và thủy sản", "summary": "Khai thác thế mạnh nhiệt đới để phát triển trồng trọt, chăn nuôi và kinh tế biển." },
    { "chapter": "Chương 3: Địa lí các ngành kinh tế", "lesson": "Bài 6: Tổ chức lãnh thổ nông nghiệp", "summary": "Sự hình thành các vùng chuyên canh cây công nghiệp, cây ăn quả và vùng trọng điểm lương thực." },
    { "chapter": "Chương 3: Địa lí các ngành kinh tế", "lesson": "Bài 7: Vấn đề phát triển ngành công nghiệp", "summary": "Phát triển các ngành công nghiệp trọng điểm như năng lượng, chế biến lương thực thực phẩm." },
    { "chapter": "Chương 3: Địa lí các ngành kinh tế", "lesson": "Bài 8: Tổ chức lãnh thổ công nghiệp", "summary": "Tìm hiểu các khu công nghiệp, khu chế xuất và các trung tâm công nghiệp lớn." },
    { "chapter": "Chương 3: Địa lí các ngành kinh tế", "lesson": "Bài 9: Phát triển ngành giao thông vận tải và bưu chính viễn thông", "summary": "Mạng lưới đường bộ, đường sắt, hàng không và sự bùng nổ của hạ tầng số." },
    { "chapter": "Chương 3: Địa lí các ngành kinh tế", "lesson": "Bài 10: Phát triển ngành thương mại và du lịch", "summary": "Thị trường nội địa, xuất nhập khẩu và các trung tâm du lịch trọng điểm quốc gia." },
    { "chapter": "Chương 4: Địa lí các vùng kinh tế", "lesson": "Bài 11: Vùng Trung du và miền núi Bắc Bộ", "summary": "Khai thác thế mạnh về thủy điện, khoáng sản và cây công nghiệp cận nhiệt." },
    { "chapter": "Chương 4: Địa lí các vùng kinh tế", "lesson": "Bài 12: Vùng Đồng bằng sông Hồng", "summary": "Phát triển kinh tế dựa trên hạ tầng hiện đại và nguồn lao động chất lượng cao." },
    { "chapter": "Chương 4: Địa lí các vùng kinh tế", "lesson": "Bài 13: Vùng Bắc Trung Bộ và Duyên hải miền Trung", "summary": "Phát triển kinh tế biển tổng hợp và ứng phó với thiên tai, biến đổi khí hậu." },
    { "chapter": "Chương 4: Địa lí các vùng kinh tế", "lesson": "Bài 14: Vùng Tây Nguyên", "summary": "Phát triển cây công nghiệp dài ngày và bảo vệ tài nguyên rừng, nguồn nước." },
    { "chapter": "Chương 4: Địa lí các vùng kinh tế", "lesson": "Bài 15: Vùng Đông Nam Bộ", "summary": "Vùng kinh tế năng động nhất với sự phát triển mạnh mẽ của công nghiệp và dịch vụ." },
    { "chapter": "Chương 4: Địa lí các vùng kinh tế", "lesson": "Bài 16: Vùng Đồng bằng sông Cửu Long", "summary": "Trọng điểm sản xuất lương thực và thích ứng với xâm nhập mặn." },
    { "chapter": "Chương 5: Địa lí địa phương", "lesson": "Bài 17: Tìm hiểu địa lí tỉnh/thành phố", "summary": "Hướng dẫn phương pháp thu thập số liệu và viết báo cáo về tình hình kinh tế địa phương." }
],
"Giáo dục Kinh tế và Pháp luật": [
    { "chapter": "Chủ đề 1: Tăng trưởng và phát triển kinh tế", "lesson": "Bài 1: Tăng trưởng và phát triển kinh tế", "summary": "Phân biệt khái niệm tăng trưởng (số lượng) và phát triển (chất lượng) kinh tế bền vững." },
    { "chapter": "Chủ đề 2: Hội nhập kinh tế quốc tế", "lesson": "Bài 2: Hội nhập kinh tế quốc tế", "summary": "Các hình thức hội nhập (song phương, đa phương) và tác động của nó đến kinh tế Việt Nam." },
    { "chapter": "Chủ đề 3: Bảo hiểm và an sinh xã hội", "lesson": "Bài 3: Bảo hiểm", "summary": "Vai trò của bảo hiểm xã hội, bảo hiểm y tế và bảo hiểm thất nghiệp trong việc chia sẻ rủi ro." },
    { "chapter": "Chủ đề 3: Bảo hiểm và an sinh xã hội", "lesson": "Bài 4: An sinh xã hội", "summary": "Hệ thống các chính sách trợ giúp xã hội nhằm đảm bảo đời sống tối thiểu cho người dân." },
    { "chapter": "Chủ đề 4: Lập kế hoạch kinh doanh và đạo đức kinh doanh", "lesson": "Bài 5: Lập kế hoạch kinh doanh", "summary": "Các bước xây dựng một bản kế hoạch kinh doanh hoàn chỉnh từ ý tưởng đến thực thi." },
    { "chapter": "Chủ đề 4: Lập kế hoạch kinh doanh và đạo đức kinh doanh", "lesson": "Bài 6: Đạo đức kinh doanh", "summary": "Vai trò của đạo đức trong việc xây dựng uy tín thương hiệu và phát triển doanh nghiệp bền vững." },
    { "chapter": "Chủ đề 5: Quyền và nghĩa vụ của công dân về kinh tế", "lesson": "Bài 7: Quyền và nghĩa vụ của công dân về sở hữu tài sản và tự do kinh doanh", "summary": "Các quy định pháp luật bảo vệ quyền sở hữu hợp pháp và quyền tự do lựa chọn ngành nghề kinh doanh." },
    { "chapter": "Chủ đề 5: Quyền và nghĩa vụ của công dân về kinh tế", "lesson": "Bài 8: Quyền và nghĩa vụ của công dân về nộp thuế", "summary": "Tìm hiểu các loại thuế cơ bản và trách nhiệm đóng góp vào ngân sách nhà nước của công dân." }
],
"Tin học": [
    { "chapter": "Chủ đề 1: Máy tính và xã hội tri thức", "lesson": "Bài 1: Trí tuệ nhân tạo và đời sống", "summary": "Khái niệm cơ bản về AI, lịch sử phát triển và tác động của AI đối với xã hội loài người." },
    { "chapter": "Chủ đề 1: Máy tính và xã hội tri thức", "lesson": "Bài 2: Một số ứng dụng điển hình của AI", "summary": "Tìm hiểu các ứng dụng thực tế như nhận diện khuôn mặt, xe tự lái, và các hệ chuyên gia." },
    { "chapter": "Chủ đề 2: Mạng máy tính và Internet", "lesson": "Bài 3: Thiết bị mạng và giao thức mạng", "summary": "Tìm hiểu về Switch, Router và giao thức TCP/IP đóng vai trò quan trọng trong việc truyền tải dữ liệu." },
    { "chapter": "Chủ đề 2: Mạng máy tính và Internet", "lesson": "Bài 4: Các thiết bị kết nối và dịch vụ mạng", "summary": "Cách thiết lập mạng nội bộ, mạng không dây và các dịch vụ lưu trữ, trao đổi thông tin hiện đại." },
    { "chapter": "Chủ đề 3: Đạo đức, pháp luật và văn hóa trong môi trường số", "lesson": "Bài 5: Một số vấn đề pháp lí về sở hữu trí tuệ và giao dịch kĩ thuật số", "summary": "Luật an ninh mạng, bản quyền phần mềm và các quy định về kinh doanh trên nền tảng số." },
    { "chapter": "Chủ đề 4: Giải quyết vấn đề với sự trợ giúp của máy tính (Thiết kế Web)", "lesson": "Bài 6: Giới thiệu HTML và CSS", "summary": "Vai trò của ngôn ngữ đánh dấu văn bản (HTML) và ngôn ngữ định dạng bậc thang (CSS) trong cấu trúc web." },
    { "chapter": "Chủ đề 4: Giải quyết vấn đề với sự trợ giúp của máy tính (Thiết kế Web)", "lesson": "Bài 7: Tạo trang web đơn giản với HTML và CSS", "summary": "Thực hành viết những dòng code đầu tiên để tạo nên giao diện cơ bản cho một trang tin tức." },
    { "chapter": "Chủ đề 4: Giải quyết vấn đề với sự trợ giúp của máy tính (Thiết kế Web)", "lesson": "Bài 8: Làm việc với các thành phần của trang web", "summary": "Cách chèn hình ảnh, video, tạo bảng và các liên kết (hyperlinks) cho trang web sinh động." },
    { "chapter": "Chủ đề 4: Giải quyết vấn đề với sự trợ giúp của máy tính (Thiết kế Web)", "lesson": "Bài 9: Tạo và quản lí dự án trang web", "summary": "Quy trình xây dựng một website hoàn chỉnh và các bước đưa trang web lên môi trường Internet." },
    { "chapter": "Chủ đề 5: Hướng nghiệp với Tin học", "lesson": "Bài 10: Nghề nghiệp trong lĩnh vực Tin học", "summary": "Tìm hiểu về các vị trí như lập trình viên, kỹ sư dữ liệu, thiết kế web và lộ trình phát triển nghề nghiệp." }
],
"Công nghệ": [
    { "chapter": "Chương 1: Giới thiệu chung về kĩ thuật điện", "lesson": "Bài 1: Khái quát về kĩ thuật điện", "summary": "Tìm hiểu vai trò, triển vọng phát triển của ngành kĩ thuật điện trong sản xuất và đời sống." },
    { "chapter": "Chương 1: Giới thiệu chung về kĩ thuật điện", "lesson": "Bài 2: Nghề nghiệp trong lĩnh vực kĩ thuật điện", "summary": "Các vị trí công việc, yêu cầu về năng lực và định hướng nghề nghiệp cho kĩ sư điện, thợ điện." },
    { "chapter": "Chương 2: Hệ thống điện quốc gia", "lesson": "Bài 3: Mạch điện xoay chiều ba pha", "summary": "Khái niệm về nguồn điện ba pha, các cách nối hình sao (Y), hình tam giác (Δ) và ưu điểm của hệ thống." },
    { "chapter": "Chương 2: Hệ thống điện quốc gia", "lesson": "Bài 4: Hệ thống điện quốc gia", "summary": "Cấu trúc gồm các khâu sản xuất, truyền tải và phân phối điện năng trên phạm vi toàn quốc." },
    { "chapter": "Chương 3: Mạch điện xoay chiều ba pha", "lesson": "Bài 5: Máy biến áp ba pha", "summary": "Cấu tạo, nguyên lí làm việc và công dụng của máy biến áp trong việc điều chỉnh điện áp mạch ba pha." },
    { "chapter": "Chương 3: Mạch điện xoay chiều ba pha", "lesson": "Bài 6: Động cơ điện ba pha", "summary": "Nguyên lí tạo ra từ trường quay và cách vận hành các loại động cơ không đồng bộ ba pha." },
    { "chapter": "Chương 3: Mạch điện xoay chiều ba pha", "lesson": "Bài 7: Máy phát điện xoay chiều ba pha", "summary": "Cấu tạo và nguyên lí biến đổi cơ năng thành điện năng xoay chiều ba pha." },
    { "chapter": "Chương 4: Mạch điện dân dụng", "lesson": "Bài 8: Mạch điện chiếu sáng trong gia đình", "summary": "Cách thiết kế, sơ đồ đi dây và các thiết bị đóng cắt, bảo vệ cho hệ thống chiếu sáng dân dụng." },
    { "chapter": "Chương 4: Mạch điện dân dụng", "lesson": "Bài 9: Mạch điện ổ cắm và thiết bị gia dụng", "summary": "Quy trình lắp đặt mạch điện cấp nguồn cho các thiết bị công suất lớn trong nhà." },
    { "chapter": "Chương 4: Mạch điện dân dụng", "lesson": "Bài 10: Thiết kế mạch điện dân dụng đơn giản", "summary": "Các bước tính toán phụ tải và lựa chọn dây dẫn, thiết bị phù hợp cho hộ gia đình." },
    { "chapter": "Chương 5: An toàn điện", "lesson": "Bài 11: An toàn điện và sơ cứu người bị tai nạn điện", "summary": "Các nguyên tắc an toàn, trang bị bảo hộ và kỹ năng cấp cứu nhanh khi có sự cố điện." },
    { "chapter": "Chương 6: Linh kiện điện tử", "lesson": "Bài 12: Điện trở, tụ điện, cuộn cảm", "summary": "Kí hiệu, đơn vị và công dụng của các linh kiện thụ động cơ bản trong mạch điện tử." },
    { "chapter": "Chương 6: Linh kiện điện tử", "lesson": "Bài 13: Linh kiện bán dẫn và vi mạch", "summary": "Cấu tạo, nguyên lí của Diode, Transistor, Thyristor và các loại IC tích hợp." },
    { "chapter": "Chương 7: Mạch điện tử cơ bản", "lesson": "Bài 14: Mạch chỉnh lưu và mạch lọc", "summary": "Cách biến đổi dòng điện xoay chiều (AC) thành dòng điện một chiều (DC) phục vụ thiết bị điện tử." },
    { "chapter": "Chương 7: Mạch điện tử cơ bản", "lesson": "Bài 15: Mạch khuếch đại và mạch tạo xung", "summary": "Nguyên lí làm việc của các mạch dùng Transistor để tăng biên độ tín hiệu hoặc tạo tín hiệu điều khiển." },
    { "chapter": "Chương 8: Vi điều khiển", "lesson": "Bài 16: Khái quát về vi điều khiển", "summary": "Cấu trúc phần cứng của vi điều khiển và ứng dụng của nó trong các hệ thống nhúng tự động." },
    { "chapter": "Chương 8: Vi điều khiển", "lesson": "Bài 17: Lập trình điều khiển đơn giản cho vi điều khiển", "summary": "Làm quen với quy trình viết mã, nạp chương trình để điều khiển các linh kiện như LED, cảm biến." }
]
}
